sunjinkun/GD32G5X3-/CMSIS/GD/GD32G5x3/Source/ARM/startup_gd32g5x3.s
                LDR     r0, =0x1FFFB3E0
                LDR     r2, [r0]
                LDR     r0, = 0xFFFF0000
                AND     r2, r2, r0
                LSR     r2, r2, #16
                LSL     r2, r2, #10
                LDR     r0, =|Image$$RW_IRAM1$$RW$$Base|
                ADD     r1, r0, r2
                LDR     r2, =0x0
MEM_INIT        STRD    r2, r2, [ r0 ] , #8
                CMP     r0, r1
                BNE     MEM_INIT

                LDR     r0, =SystemInit
                BLX     r0
                LDR     r0, =__main
                BX      r0
                ENDP

;/* dummy Exception Handlers */
NMI_Handler\
                PROC
                EXPORT  NMI_Handler                       [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                 [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                 [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                  [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                       [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                  [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler                    [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler                   [WEAK]
                B       .
                ENDP

Default_Handler PROC
;               /* external interrupts handler */
                EXPORT  WWDGT_IRQHandler                  [WEAK]
                EXPORT  LVD_VAVD_VOVD_VUVD_IRQHandler        [WEAK]
                EXPORT  TAMPER_IRQHandler                 [WEAK]
                EXPORT  RTC_WKUP_IRQHandler               [WEAK]
                EXPORT  FMC_IRQHandler                    [WEAK]
                EXPORT  RCU_IRQHandler                    [WEAK]
                EXPORT  EXTI0_IRQHandler                  [WEAK]
                EXPORT  EXTI1_IRQHandler                  [WEAK]
                EXPORT  EXTI2_IRQHandler                  [WEAK]
                EXPORT  EXTI3_IRQHandler                  [WEAK]
                EXPORT  EXTI4_IRQHandler                  [WEAK]
                EXPORT  DMA0_Channel0_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel1_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel2_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel3_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel4_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel5_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel6_IRQHandler          [WEAK]
                EXPORT  ADC0_1_IRQHandler                 [WEAK]
                EXPORT  EXTI5_9_IRQHandler                [WEAK]
                EXPORT  TIMER0_BRK_IRQHandler             [WEAK]
                EXPORT  TIMER0_UP_IRQHandler              [WEAK]
                EXPORT  TIMER0_TRG_CMT_IDX_IRQHandler     [WEAK]
                EXPORT  TIMER0_Channel_IRQHandler         [WEAK]
                EXPORT  TIMER1_IRQHandler                 [WEAK]
                EXPORT  TIMER2_IRQHandler                 [WEAK]
                EXPORT  TIMER3_IRQHandler                 [WEAK]
                EXPORT  I2C0_EV_WKUP_IRQHandler           [WEAK]
                EXPORT  I2C0_ER_IRQHandler                [WEAK]
                EXPORT  I2C1_EV_WKUP_IRQHandler           [WEAK]
                EXPORT  I2C1_ER_IRQHandler                [WEAK]
                EXPORT  SPI0_IRQHandler                   [WEAK]
                EXPORT  SPI1_IRQHandler                   [WEAK]
                EXPORT  USART0_IRQHandler                 [WEAK]
                EXPORT  USART1_IRQHandler                 [WEAK]
                EXPORT  USART2_IRQHandler                 [WEAK]
                EXPORT  EXTI10_15_IRQHandler              [WEAK]
                EXPORT  RTC_Alarm_IRQHandler              [WEAK]
                EXPORT  TIMER7_BRK_TRS_IDX_IRQHandler     [WEAK]
                EXPORT  TIMER7_UP_IRQHandler              [WEAK]
                EXPORT  TIMER7_TRG_CMT_IDX_IRQHandler     [WEAK]
                EXPORT  TIMER7_Channel_IRQHandler         [WEAK]
                EXPORT  ADC2_IRQHandler                   [WEAK]
                EXPORT  SYSCFG_IRQHandler                 [WEAK]
                EXPORT  LPTIMER_IRQHandler                [WEAK]
                EXPORT  TIMER4_IRQHandler                 [WEAK]
                EXPORT  SPI2_IRQHandler                   [WEAK]
                EXPORT  UART3_IRQHandler                  [WEAK]
                EXPORT  UART4_IRQHandler                  [WEAK]
                EXPORT  TIMER5_DAC0_2_UDR_IRQHandler      [WEAK]
                EXPORT  TIMER6_DAC1_3_UDR_IRQHandler      [WEAK]
                EXPORT  DMA1_Channel0_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel1_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel2_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel3_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel4_IRQHandler          [WEAK]
                EXPORT  ADC3_IRQHandler                   [WEAK]
                EXPORT  VUVD1_VOVD1_IRQHandler            [WEAK]
                EXPORT  CMP0_3_IRQHandler                 [WEAK]
                EXPORT  CMP4_7_IRQHandler                 [WEAK]
                EXPORT  CMP_IRQHandler                    [WEAK]
                EXPORT  HRTIMER_IRQ0_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ1_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ2_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ3_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ4_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ5_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ6_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ7_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ8_IRQHandler           [WEAK]
                EXPORT  HRTIMER_IRQ9_IRQHandler           [WEAK]
                EXPORT  TIMER19_BRK_TRS_IDX_IRQHandler    [WEAK]
                EXPORT  TIMER19_UP_IRQHandler             [WEAK]
                EXPORT  TIMER19_TRG_CMT_IDX_IRQHandler    [WEAK]
                EXPORT  TIMER19_Channel_IRQHandler        [WEAK]
                EXPORT  FPU_IRQHandler                    [WEAK]
                EXPORT  I2C2_EV_WKUP_IRQHandler           [WEAK]
                EXPORT  I2C2_ER_IRQHandler                [WEAK]
                EXPORT  CAU_IRQHandler                    [WEAK]
                EXPORT  TRNG_IRQHandler                   [WEAK]
                EXPORT  I2C3_EV_WKUP_IRQHandler           [WEAK]
                EXPORT  I2C3_ER_IRQHandler                [WEAK]
                EXPORT  DMAMUX_OVR_IRQHandler             [WEAK]
                EXPORT  QSPI_IRQHandler                   [WEAK]
                EXPORT  FFT_IRQHandler                    [WEAK]
                EXPORT  DMA1_Channel5_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel6_IRQHandler          [WEAK]
                EXPORT  CLA_IRQHandler                    [WEAK]
                EXPORT  TMU_IRQHandler                    [WEAK]
                EXPORT  FAC_IRQHandler                    [WEAK]
                EXPORT  HPDF_INT0_IRQHandler              [WEAK]
                EXPORT  HPDF_INT1_IRQHandler              [WEAK]
                EXPORT  HPDF_INT2_IRQHandler              [WEAK]
                EXPORT  HPDF_INT3_IRQHandler              [WEAK]
                EXPORT  TIMER14_IRQHandler                [WEAK]
                EXPORT  TIMER15_IRQHandler                [WEAK]
                EXPORT  TIMER16_IRQHandler                [WEAK]
                EXPORT  CAN0_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN0_Message_IRQHandler           [WEAK]
                EXPORT  CAN0_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN0_Error_IRQHandler             [WEAK]
                EXPORT  CAN0_FastError_IRQHandler         [WEAK]
                EXPORT  CAN0_TEC_IRQHandler               [WEAK]
                EXPORT  CAN0_REC_IRQHandler               [WEAK]
                EXPORT  CAN1_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN1_Message_IRQHandler           [WEAK]
                EXPORT  CAN1_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN1_Error_IRQHandler             [WEAK]
                EXPORT  CAN1_FastError_IRQHandler         [WEAK]
                EXPORT  CAN1_TEC_IRQHandler               [WEAK]
                EXPORT  CAN1_REC_IRQHandler               [WEAK]
                EXPORT  CAN2_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN2_Message_IRQHandler           [WEAK]
                EXPORT  CAN2_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN2_Error_IRQHandler             [WEAK]
                EXPORT  CAN2_FastError_IRQHandler         [WEAK]
                EXPORT  CAN2_TEC_IRQHandler               [WEAK]
                EXPORT  CAN2_REC_IRQHandler               [WEAK]
                EXPORT  TIMER0_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER1_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER2_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER3_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER4_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER7_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER19_DEC_IRQHandler            [WEAK]

;/* external interrupts handler */
WWDGT_IRQHandler                  
LVD_VAVD_VOVD_VUVD_IRQHandler        
TAMPER_IRQHandler                 
RTC_WKUP_IRQHandler               
FMC_IRQHandler                    
RCU_IRQHandler                    
EXTI0_IRQHandler                  
EXTI1_IRQHandler                  
EXTI2_IRQHandler                  
EXTI3_IRQHandler                  
EXTI4_IRQHandler                  
DMA0_Channel0_IRQHandler          
DMA0_Channel1_IRQHandler          
DMA0_Channel2_IRQHandler          
DMA0_Channel3_IRQHandler          
DMA0_Channel4_IRQHandler          
DMA0_Channel5_IRQHandler          
DMA0_Channel6_IRQHandler          
ADC0_1_IRQHandler                 
EXTI5_9_IRQHandler                
TIMER0_BRK_IRQHandler             
TIMER0_UP_IRQHandler              
TIMER0_TRG_CMT_IDX_IRQHandler     
TIMER0_Channel_IRQHandler         
TIMER1_IRQHandler                 
TIMER2_IRQHandler                 
TIMER3_IRQHandler                 
I2C0_EV_WKUP_IRQHandler           
I2C0_ER_IRQHandler                
I2C1_EV_WKUP_IRQHandler           
I2C1_ER_IRQHandler                
SPI0_IRQHandler                   
SPI1_IRQHandler                   
USART0_IRQHandler                 
USART1_IRQHandler                 
USART2_IRQHandler                 
EXTI10_15_IRQHandler              
RTC_Alarm_IRQHandler              
TIMER7_BRK_TRS_IDX_IRQHandler     
TIMER7_UP_IRQHandler              
TIMER7_TRG_CMT_IDX_IRQHandler     
TIMER7_Channel_IRQHandler         
ADC2_IRQHandler                   
SYSCFG_IRQHandler                 
LPTIMER_IRQHandler                
TIMER4_IRQHandler                 
SPI2_IRQHandler                   
UART3_IRQHandler                  
UART4_IRQHandler                  
TIMER5_DAC0_2_UDR_IRQHandler      
TIMER6_DAC1_3_UDR_IRQHandler      
DMA1_Channel0_IRQHandler          
DMA1_Channel1_IRQHandler          
DMA1_Channel2_IRQHandler          
DMA1_Channel3_IRQHandler          
DMA1_Channel4_IRQHandler          
ADC3_IRQHandler                   
VUVD1_VOVD1_IRQHandler            
CMP0_3_IRQHandler                 
CMP4_7_IRQHandler                 
CMP_IRQHandler                    
HRTIMER_IRQ0_IRQHandler           
HRTIMER_IRQ1_IRQHandler           
HRTIMER_IRQ2_IRQHandler           
HRTIMER_IRQ3_IRQHandler           
HRTIMER_IRQ4_IRQHandler           
HRTIMER_IRQ5_IRQHandler           
HRTIMER_IRQ6_IRQHandler           
HRTIMER_IRQ7_IRQHandler           
HRTIMER_IRQ8_IRQHandler           
HRTIMER_IRQ9_IRQHandler           
TIMER19_BRK_TRS_IDX_IRQHandler    
TIMER19_UP_IRQHandler             
TIMER19_TRG_CMT_IDX_IRQHandler    
TIMER19_Channel_IRQHandler        
FPU_IRQHandler                    
I2C2_EV_WKUP_IRQHandler           
I2C2_ER_IRQHandler                
CAU_IRQHandler                    
TRNG_IRQHandler                   
I2C3_EV_WKUP_IRQHandler           
I2C3_ER_IRQHandler                
DMAMUX_OVR_IRQHandler             
QSPI_IRQHandler                   
FFT_IRQHandler                    
DMA1_Channel5_IRQHandler          
DMA1_Channel6_IRQHandler          
CLA_IRQHandler                    
TMU_IRQHandler                    
FAC_IRQHandler                    
HPDF_INT0_IRQHandler              
HPDF_INT1_IRQHandler              
HPDF_INT2_IRQHandler              
HPDF_INT3_IRQHandler              
TIMER14_IRQHandler                
TIMER15_IRQHandler                
TIMER16_IRQHandler                
CAN0_WKUP_IRQHandler              
CAN0_Message_IRQHandler           
CAN0_Busoff_IRQHandler            
CAN0_Error_IRQHandler             
CAN0_FastError_IRQHandler         
CAN0_TEC_IRQHandler               
CAN0_REC_IRQHandler               
CAN1_WKUP_IRQHandler              
CAN1_Message_IRQHandler           
CAN1_Busoff_IRQHandler            
CAN1_Error_IRQHandler             
CAN1_FastError_IRQHandler         
CAN1_TEC_IRQHandler               
CAN1_REC_IRQHandler               
CAN2_WKUP_IRQHandler              
CAN2_Message_IRQHandler           
CAN2_Busoff_IRQHandler            
CAN2_Error_IRQHandler             
CAN2_FastError_IRQHandler         
CAN2_TEC_IRQHandler               
CAN2_REC_IRQHandler               
TIMER0_DEC_IRQHandler             
TIMER1_DEC_IRQHandler             
TIMER2_DEC_IRQHandler             
TIMER3_DEC_IRQHandler             
TIMER4_DEC_IRQHandler             
TIMER7_DEC_IRQHandler             
TIMER19_DEC_IRQHandler            

                B       .
                ENDP

                ALIGN

; user Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END
